test/cassettes/new_stripe_customer.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: US-ASCII
      string: card[number]=4242424242424242&card[exp_month]=7&card[exp_year]=2019&card[cvc]=314
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.23.0
      Authorization:
      - Bearer sk_test_BFrpXwChkcFOCCdJSsppJiwk
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.23.0","lang":"ruby","lang_version":"2.2.0 p0 (2014-12-25)","platform":"x86_64-darwin13","engine":"ruby","publisher":"stripe","uname":"Darwin
        maryanne.local 14.4.0 Darwin Kernel Version 14.4.0: Thu May 28 11:35:04 PDT
        2015; root:xnu-2782.30.5~1/RELEASE_X86_64 x86_64 i386 MacBookPro12,1 Darwin","hostname":"maryanne.local"}'
      Content-Length:
      - '81'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 05 Nov 2015 21:58:05 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '779'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_7IWndDmUQ1wJ3A
      Stripe-Version:
      - '2015-06-15'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_173vk9Eq8J2bfnqAImlwPKSu",
          "object": "token",
          "card": {
            "id": "card_173vk8Eq8J2bfnqA4oPKgSPT",
            "object": "card",
            "address_city": null,
            "address_country": null,
            "address_line1": null,
            "address_line1_check": null,
            "address_line2": null,
            "address_state": null,
            "address_zip": null,
            "address_zip_check": null,
            "brand": "Visa",
            "country": "US",
            "cvc_check": "unchecked",
            "dynamic_last4": null,
            "exp_month": 7,
            "exp_year": 2019,
            "fingerprint": "duspC3ZpcqHaLZSH",
            "funding": "credit",
            "last4": "4242",
            "metadata": {},
            "name": null,
            "tokenization_method": null
          },
          "client_ip": "24.246.15.49",
          "created": 1446760685,
          "livemode": false,
          "type": "card",
          "used": false
        }
    http_version: 
  recorded_at: Thu, 05 Nov 2015 21:58:05 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: US-ASCII
      string: source=tok_173vk9Eq8J2bfnqAImlwPKSu&email=alice14%40example.com
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.23.0
      Authorization:
      - Bearer sk_test_BFrpXwChkcFOCCdJSsppJiwk
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.23.0","lang":"ruby","lang_version":"2.2.0 p0 (2014-12-25)","platform":"x86_64-darwin13","engine":"ruby","publisher":"stripe","uname":"Darwin
        maryanne.local 14.4.0 Darwin Kernel Version 14.4.0: Thu May 28 11:35:04 PDT
        2015; root:xnu-2782.30.5~1/RELEASE_X86_64 x86_64 i386 MacBookPro12,1 Darwin","hostname":"maryanne.local"}'
      Content-Length:
      - '63'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 05 Nov 2015 21:58:05 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1396'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_7IWnxYsCMbxzvL
      Stripe-Version:
      - '2015-06-15'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_7IWnuEGiC0xaAq",
          "object": "customer",
          "account_balance": 0,
          "created": 1446760685,
          "currency": null,
          "default_source": "card_173vk8Eq8J2bfnqA4oPKgSPT",
          "delinquent": false,
          "description": null,
          "discount": null,
          "email": "alice14@example.com",
          "livemode": false,
          "metadata": {},
          "shipping": null,
          "sources": {
            "object": "list",
            "data": [
              {
                "id": "card_173vk8Eq8J2bfnqA4oPKgSPT",
                "object": "card",
                "address_city": null,
                "address_country": null,
                "address_line1": null,
                "address_line1_check": null,
                "address_line2": null,
                "address_state": null,
                "address_zip": null,
                "address_zip_check": null,
                "brand": "Visa",
                "country": "US",
                "customer": "cus_7IWnuEGiC0xaAq",
                "cvc_check": "pass",
                "dynamic_last4": null,
                "exp_month": 7,
                "exp_year": 2019,
                "fingerprint": "duspC3ZpcqHaLZSH",
                "funding": "credit",
                "last4": "4242",
                "metadata": {},
                "name": null,
                "tokenization_method": null
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_7IWnuEGiC0xaAq/sources"
          },
          "subscriptions": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_7IWnuEGiC0xaAq/subscriptions"
          }
        }
    http_version: 
  recorded_at: Thu, 05 Nov 2015 21:58:06 GMT
recorded_with: VCR 2.9.3
